In [3]:
#Topic 2 : Remove duplicates

import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Alice", "David"],
    "Age": [25, 30, 25, 40],
    "City": ["NY", "LA", "NY", "Chicago"]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

df_cleaned = df.drop_duplicates()

print("\nModified DataFrame (no duplicates)")
print(df_cleaned)

Original DataFrame:
    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

Modified DataFrame (no duplicates)
    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [5]:
#dropping duplicates based on specific colums

import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 30, 40],
    'City': ['NY', 'LA', 'SF', 'Chicago']
})

df_cleaned = df.drop_duplicates(subset=["Age"])

print(df_cleaned)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [6]:

import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 25, 40],
    'City': ['NY', 'LA', 'NY', 'Chicago']
})

df_cleaned= df.drop_duplicates(keep='last')
print(df_cleaned)

    Name  Age     City
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

In [7]:

import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 25, 40],
    'City': ['NY', 'LA', 'NY', 'Chicago']
})

df_cleaned= df.drop_duplicates(keep='last')
print(df_cleaned)

    Name  Age     City
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

In [8]:
# remove all rows that are duplicate
import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 25, 40],
    'City': ['NY', 'LA', 'NY', 'Chicago']
})
df_cleaned = df.drop_duplicates(keep=False)
print(df_cleaned)

    Name  Age     City
1    Bob   30       LA
3  David   40  Chicago

In [11]:
# modifing original dataframe directly all above create a duplicate  record


df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 25, 40],
    'City': ['NY', 'LA', 'NY', 'Chicago']
})
df.drop_duplicates(inplace=True)
print(df)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [12]:
# If two rows have the same "Name" and "City", one of them will be dropped.

# Other columns are ignored for the duplicate check.


import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Alice", "David", "Bob"],
    "Age": [25, 20, 25, 40, 30],
    "City": ["NY", "LA", "NY", "Chicago", "LA"]
}

df = pd.DataFrame(data)
df_cleaned = df.drop_duplicates()

df_cleaned = df.drop_duplicates(subset=["Name", "City"])
print(df)

print(df_cleaned)

    Name  Age     City
0  Alice   25       NY
1    Bob   20       LA
2  Alice   25       NY
3  David   40  Chicago
4    Bob   30       LA
    Name  Age     City
0  Alice   25       NY
1    Bob   20       LA
3  David   40  Chicago

In [13]:
# Topic 3 pandas change datatype
#using as type

import pandas as pd

data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'], 
        'Age': [25, 30, 22, 35, 28], 
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'], 
        'Salary': [50000, 55000, 40000, 70000, 48000]}

df = pd.DataFrame(data)
print(df.dtypes)

# Convert 'Age' column to float type
df['Age'] = df['Age'].astype(float)
print(df.dtypes)

Name      object
Age        int64
Gender    object
Salary     int64
dtype: object
Name       object
Age       float64
Gender     object
Salary      int64
dtype: object

In [45]:
#Topic 4 : Drop empty columns in pandas

import numpy as np
import pandas as pd

df = pd.DataFrame({'FirstName': ['Vipul', 'Ashish', 'Milan'],
                            "Gender": ["", "", ""],
                            "Age": [0, 0, 0]})
df['Department'] = np.nan      #Create a new column named Department

print(df)

  FirstName Gender  Age  Department
0     Vipul           0         NaN
1    Ashish           0         NaN
2     Milan           0         NaN

In [54]:
df["Department"]=np.nan
display (df)
nan_value=float('NaN')
r=df.replace('', nan_value)
display(r)
df.dropna(how="all",axis=1,inplace=True)
display(df)

  FirstName Gender  Age  Department
0     Vipul           0         NaN
1    Ashish           0         NaN
2     Milan           0         NaN

C:\Users\JESNY\AppData\Local\Temp\ipykernel_11304\4053958274.py:4: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  r=df.replace('', nan_value)

  FirstName  Gender  Age  Department
0     Vipul     NaN    0         NaN
1    Ashish     NaN    0         NaN
2     Milan     NaN    0         NaN

  FirstName Gender  Age
0     Vipul           0
1    Ashish           0
2     Milan           0

In [57]:
r=df.replace(0,nan_value)
display(r)
r.dropna(how="all",axis=1,inplace=True)
display(r)

  FirstName Gender  Age
0     Vipul         NaN
1    Ashish         NaN
2     Milan         NaN

  FirstName Gender
0     Vipul
1    Ashish
2     Milan

In [26]:
nan_value=float("NaN")
df.replace(0,nan_value, inplace=True)
df.replace(" ", nan_value, inplace=True)
df.dropna(how="all",axis=1,inplace=True)
display(df)

  FirstName Gender
0     Vipul
1    Ashish
2     Milan